<a href="https://colab.research.google.com/github/lero003/python/blob/master/Pandas_03.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 columns=['col01','col02','col03'],
                 index=['idx01','idx02','idx03'])

In [ ]:
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [ ]:
import numpy as np #高速にリストを計算するライブラリ

In [ ]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                 columns=['col01','col02','col03'],
                 index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [ ]:
df.index

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [ ]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [ ]:
df = pd.DataFrame({'col01':[1,2,3],
                  'col02':[4,5,6],
                  'col03':[7,8,9]})
df

   col01  col02  col03
0      1      4      7
1      2      5      8
2      3      6      9

In [ ]:
df = pd.DataFrame({'col01':[1,2,3],
                  'col02':[4,5,6],
                  'col03':[7,8,9]})
df.index=['idx01','idx02','idx03']
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [ ]:
df = pd.DataFrame({'col01':[1,2,3],
                  'col02':[4,5,6],
                  'col03':[7,8,9]},
                  index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [ ]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
df.columns=['col01','col02','col03']
df.index=['idx01','idx02','idx03']

In [ ]:
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [ ]:
df.columns=['col04','col05','col06']

In [ ]:
df

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [ ]:
df = df.rename(columns={'col04':'x'})
df

       x  col05  col06
idx01  1      2      3
idx02  4      5      6
idx03  7      8      9

In [ ]:
df = df.rename(columns={'col05':'y','col06':'z'})
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [ ]:
df = df.rename(index={'idx01':'w'})
df

       x  y  z
w      1  2  3
idx02  4  5  6
idx03  7  8  9

In [ ]:
df['x']

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [ ]:
type(df['x'])

pandas.core.series.Series

In [ ]:
df[['x']]

       x
w      1
idx02  4
idx03  7

In [ ]:
type(df[['x']])

pandas.core.frame.DataFrame

In [ ]:
df

       x  y  z
w      1  2  3
idx02  4  5  6
idx03  7  8  9

In [ ]:
df.loc['w']

x    1
y    2
z    3
Name: w, dtype: int64

In [ ]:
df.loc['w','x']

1

In [ ]:
df.loc[:,'x']

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [ ]:
df.iloc[:,0]

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [ ]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                 columns=['col01','col02','col03'],
                 index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [ ]:
df.loc['idx03','col02']

8

In [ ]:
df.loc['idx03','col02']=100
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7    100      9

In [ ]:
df.loc[:,'col03']=['Tokyo','Osaka','Hokkaido']
df

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7    100  Hokkaido

In [ ]:
df.loc[:,'col02':'col03']

       col02     col03
idx01      2     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [ ]:
df.iloc[:,1:3]

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7    100  Hokkaido

In [ ]:
df.index.get_loc('idx03')

2

In [ ]:
df.columns.get_loc('col02')

1

In [ ]:
df.iloc[df.index.get_loc('idx03'),df.columns.get_loc('col02')]=1000
df

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7   1000  Hokkaido

In [ ]:
df.dtypes

col01     int64
col02     int64
col03    object
dtype: object

In [ ]:
df.shape

(3, 3)

In [ ]:
df

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7   1000  Hokkaido

In [ ]:
df.T

       idx01  idx02     idx03
col01      1      4         7
col02      2      5      1000
col03  Tokyo  Osaka  Hokkaido